:PROPERTIES:
:ID:       461a4d4c-39c8-44dd-9870-76a0e310094a
:ROAM_REFS: https://www.youtube.com/playlist?list=PLRVzUdOe-XKfcsWbDn8cZRNR87MqidHfZ
:END:
#+title: React - YouTube
#+Sort: Date published (oldest)
#+begin_src jq :tangle filter.jq
# input: seconds
# output: ignore second remainder
def formattime:
  def f(u): if .>0 then "\(.)" + u else "" end ;
  # emit a stream of the remainders
  def s: foreach (60,60,24,1) as $i ([.,0];
    .[0] as $n
    | ($n/$i | floor) as $m
    | [$m, $n - ($m*$i)];
    if $i == 1 then .[0] else .[1] end);

 [s] as [$s, $m, $h, $d]
  | {s : ($s|if (.|tostring|length) == 1 then "0\(.)" else "\(.)" end),
     m : ($m|if (.|tostring|length) == 1 then "0\(.):" else "\(.):" end),
     h : ($h|f(":")),
     d : ($d|f(":"))}
  | "\(.d)\(.h)\(.m)\(.s)"[0:]
;
"* \(.title)\n: \(.uploader)
[[yt:\(.id)][YouTube]] \(.duration | formattime)\n  - [[elisp:(evil-collection-xwidget-webkit-new-tab \"yewtu.be/watch?v=\(.id)\")][Invidious]] / [[elisp:(browse-url \"yattee://watch?v=\(.id)\")][Yattee]]\n"
#+end_src
#+header: :var uri="playlist?list=PLRVzUdOe-XKfcsWbDn8cZRNR87MqidHfZ"
#+begin_src sh :results output raw :wrap
youtube-dl -j --flat-playlist "https://youtube.com/${uri}" | jq -r -f filter.jq
#+end_src

#+RESULTS:
#+begin_results
